**PANDAS**

In [2]:
import pandas as pd

In [20]:
df_A=pd.DataFrame({
        'Temperature':[20,30,40,50,60],
        'Index':['Day1','Day2','Day3','Day4','Day5']
        })
df_B=pd.DataFrame({
        'Humidity':[30,45,50,65,40],
        'Index':['Day1','Day2','Day3','Day4','Day5']
        })
joined_df=pd.merge(df_A,df_B,on='Index')
joined_df

   Temperature Index  Humidity
0           20  Day1        30
1           30  Day2        45
2           40  Day3        50
3           50  Day4        65
4           60  Day5        40

In [5]:
wide_df=pd.DataFrame({
    'Name':['Ram','Shyam'],
    'Science':[85,60],
    'math':[70,80],
    'English':[60,70]
})
print(wide_df)

    Name  Science  math  English
0    Ram       85    70       60
1  Shyam       60    80       70

In [7]:
long_df=pd.melt(
    frame=wide_df,
    id_vars=['Name'],
    var_name='Subject',
    value_name='Marks'

)
print(long_df)

    Name  Subject  Marks
0    Ram  Science     85
1  Shyam  Science     60
2    Ram     math     70
3  Shyam     math     80
4    Ram  English     60
5  Shyam  English     70

In [12]:
new_df=long_df.pivot(
    index='Name',
    columns='Subject',
    values='Marks'
)
print(new_df)

Subject  English  Science  math
Name
Ram           60       85    70
Shyam         70       60    80

In [13]:
stacked_df=long_df.stack()
print(stacked_df)

0  Name           Ram
   Subject    Science
   Marks           85
1  Name         Shyam
   Subject    Science
   Marks           60
2  Name           Ram
   Subject       math
   Marks           70
3  Name         Shyam
   Subject       math
   Marks           80
4  Name           Ram
   Subject    English
   Marks           60
5  Name         Shyam
   Subject    English
   Marks           70
dtype: object

In [15]:
unstacked_df=stacked_df.unstack()
print(unstacked_df)

    Name  Subject Marks
0    Ram  Science    85
1  Shyam  Science    60
2    Ram     math    70
3  Shyam     math    80
4    Ram  English    60
5  Shyam  English    70

In [25]:
pivot_table_df=pd.pivot_table(
    data=long_df,
 values='Marks',
 index='Name',
 columns='Subject',
 aggfunc='median'
)
print(pivot_table_df)

Subject  English  Science  math
Name
Ram         60.0     85.0  70.0
Shyam       70.0     60.0  80.0

In [62]:
data={
    'Roll':[1,2,3,4,5],
    'Name':['Ayush','Syham','','ram',''],
    'Age':[20,30,25,33,''],
    'Address':['A','B','C','D','']
}
df=pd.DataFrame(data)
df.to_csv("missing.csv",index=False)

In [63]:
df=pd.read_csv("missing.csv")
df.info()
df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Roll     5 non-null      int64
 1   Name     3 non-null      object
 2   Age      4 non-null      float64
 3   Address  4 non-null      object
dtypes: float64(1), int64(1), object(2)
memory usage: 292.0+ bytes

   Roll   Name   Age Address
0     1  Ayush  20.0       A
1     2  Syham  30.0       B
2     3    NaN  25.0       C
3     4    ram  33.0       D
4     5    NaN   NaN     NaN

In [66]:
df.shape

(5, 4)

In [ ]:
df_new=df.dropna()
df.head()

   Roll     Name   Age Address
0     1    Ayush  20.0       A
1     2    Syham  30.0       B
2     3  Unknown  25.0       C
3     4      ram  33.0       D

In [49]:
df.dropna(axis=1)
df.head()

   Roll     Name   Age Address
0     1    Ayush  20.0       A
1     2    Syham  30.0       B
2     3  Unknown  25.0       C
3     4      ram  33.0       D
4     5  Unknown   NaN     NaN

In [64]:
#fill missing values in name column with the unknown
df['Name']=df['Name'].fillna('Unknown')
df.head()

   Roll     Name   Age Address
0     1    Ayush  20.0       A
1     2    Syham  30.0       B
2     3  Unknown  25.0       C
3     4      ram  33.0       D
4     5  Unknown   NaN     NaN

In [65]:
mean_age=df['Age'].mean()
df['Age'].fillna(mean_age,inplace=True)
print(df)

   Roll     Name   Age Address
0     1    Ayush  20.0       A
1     2    Syham  30.0       B
2     3  Unknown  25.0       C
3     4      ram  33.0       D
4     5  Unknown  27.0     NaN

C:\Users\Acer\AppData\Local\Temp\ipykernel_14708\1851870428.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(mean_age,inplace=True)

In [68]:
df['Address']=df['Address'].fillna("Dharan",inplace=True)

In [69]:
df.to_csv("NEw.csv",index=False)